app/views/rssfeeds/show.html.erb

<h2>Contenu du flux : </h2>
<% @rssfeed.items.each do |item| %>
---
SELECT `items`.* FROM `items` WHERE `items`.`rssfeed_id` = 15