app/controllers/rssfeeds_controller.rb

  def index
    @rssfeeds = Rssfeed.all
---
SELECT `rssfeeds`.* FROM `rssfeeds`

  def show
    @rssfeed = Rssfeed.find(params[:id])
---
SELECT  `rssfeeds`.* FROM `rssfeeds` WHERE `rssfeeds`.`id` = 2 LIMIT 1

  def create
  @rssfeed = Rssfeed.new(rssfeed_params)

  if @rssfeed.save
---
INSERT INTO `rssfeeds` (`title`, `feedurl`, `created_at`, `updated_at`) VALUES ('sdfdsfsdf', 'sdfsdfsdf', '2016-10-08 07:50:26', '2016-10-08 07:50:26')

def destroy
  @rssfeed = Rssfeed.find(params[:id])
  @rssfeed.destroy
---
SELECT  `rssfeeds`.* FROM `rssfeeds` WHERE `rssfeeds`.`id` = 1 LIMIT 1
DELETE FROM `rssfeeds` WHERE `rssfeeds`.`id` = 12